Revit 2027 API
ElectricalSystem.PanelName Property
 The Panel name of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PanelName { get; }
Public ReadOnly Property PanelName As String
	Get
public:
property String^ PanelName {
	String^ get ();
}
member PanelName : string with get
Property Value
String
Remarks
 This property is used to retrieve the Panel name of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace